print('Введите предмет:')
pr1=input()
print('Количество занятий в неделю:')
z1=int(input())
print('Время одного занятия:')
t1=int(input())
print('Введите второй предмет:')
pr2=input()
print('Количество занятий в неделю:')
z2=int(input())
print('Время одного занятия:')
t2=int(input())
print('Введите время на неделю:')
svobt=int(input())
vr1=z1*t1
vr2=z2*t2
info='Сведения о предмете:'+pr1+'. ' +'Нагрузка в неделю:'+str(vr1)+'минут или '+str(vr1/60)+'часов.'
info2='Сведения о предмете:'+pr2+'. ' +'Нагрузка в неделю:'+str(vr2)+'минут или '+str(vr2/60)+'часов.'
nagruz='Общая нагрузка занятий в неделю:'+str(vr1+vr2)+' минут '+'или же '+str((vr1+vr2)/60)+' часов.'
time='Остаток свободного времени в неделю:'+str(168-(vr1+vr2)/60)+'часов.'
print(info)
print(info2)
print(nagruz)
print(time)

